{
  "Rating Scale Questions": [
    {"question": "On a scale from 1 to 10, how romantic do you consider yourself?"},
    {"question": "On a scale from 1 to 10, how important is romance in your relationship?"},
    {"question": "On a scale from 1 to 10, how often do you plan romantic activities?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy receiving romantic gestures?"},
    {"question": "On a scale from 1 to 10, how much effort do you put into keeping romance alive in your relationship?"},
    {"question": "On a scale from 1 to 10, how satisfied are you with your partner's romantic gestures?"},
    {"question": "On a scale from 1 to 10, how often do you express your love through words?"},
    {"question": "On a scale from 1 to 10, how often do you express your love through actions?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy romantic getaways?"},
    {"question": "On a scale from 1 to 10, how often do you give your partner romantic gifts?"},
    {"question": "On a scale from 1 to 10, how important are anniversaries to you?"},
    {"question": "On a scale from 1 to 10, how often do you plan surprise dates?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy romantic dinners?"},
    {"question": "On a scale from 1 to 10, how often do you cuddle with your partner?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy watching romantic movies with your partner?"},
    {"question": "On a scale from 1 to 10, how often do you express your love through physical touch?"},
    {"question": "On a scale from 1 to 10, how important is verbal affirmation in your relationship?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy planning romantic surprises?"},
    {"question": "On a scale from 1 to 10, how often do you write love notes to your partner?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy celebrating Valentine's Day?"},
    {"question": "On a scale from 1 to 10, how often do you cook special meals for your partner?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy stargazing with your partner?"},
    {"question": "On a scale from 1 to 10, how often do you hold hands with your partner?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy giving your partner massages?"},
    {"question": "On a scale from 1 to 10, how important are romantic walks to you?"},
    {"question": "On a scale from 1 to 10, how often do you compliment your partner?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy spending quiet evenings with your partner?"},
    {"question": "On a scale from 1 to 10, how often do you share your dreams and hopes with your partner?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy planning future activities with your partner?"},
    {"question": "On a scale from 1 to 10, how often do you express gratitude to your partner?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy romantic picnics?"},
    {"question": "On a scale from 1 to 10, how often do you express your love through music?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy dancing with your partner?"},
    {"question": "On a scale from 1 to 10, how often do you surprise your partner with small gifts?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy planning weekend getaways?"},
    {"question": "On a scale from 1 to 10, how often do you tell your partner 'I love you'?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy spending holidays with your partner?"},
    {"question": "On a scale from 1 to 10, how often do you help your partner with their tasks?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy creating photo albums with your partner?"},
    {"question": "On a scale from 1 to 10, how often do you share your feelings with your partner?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy sharing hobbies with your partner?"},
    {"question": "On a scale from 1 to 10, how often do you make your partner laugh?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy singing to your partner?"},
    {"question": "On a scale from 1 to 10, how often do you share your day with your partner?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy watching the sunrise with your partner?"},
    {"question": "On a scale from 1 to 10, how often do you make your partner breakfast in bed?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy discussing your future with your partner?"},
    {"question": "On a scale from 1 to 10, how often do you share a hobby with your partner?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy planning events with your partner?"},
    {"question": "On a scale from 1 to 10, how often do you give your partner compliments?"},
    {"question": "On a scale from 1 to 10, how much do you enjoy expressing your love through art?"}
  ]
}
