{
  "Yes/No Questions": [
    {"question": "Do you often write love notes or messages to your partner?"},
    {"question": "Do you enjoy watching romantic movies with your partner?"},
    {"question": "Do you believe in celebrating anniversaries in a special way?"},
    {"question": "Do you find it important to express your love verbally?"},
    {"question": "Do you enjoy receiving flowers as a romantic gesture?"},
    {"question": "Do you believe in lifelong commitment to a partner?"},
    {"question": "Do you believe in the power of love?"},
    {"question": "Do you believe that love is unconditional?"},
    {"question": "Do you enjoy surprise date nights with your partner?"},
    {"question": "Do you believe that love is the greatest feeling?"},
    {"question": "Do you enjoy cuddling with your partner?"},
    {"question": "Do you believe that love is a powerful emotion?"},
    {"question": "Do you enjoy romantic walks with your partner?"},
    {"question": "Do you believe that love is a beautiful journey?"},
    {"question": "Do you enjoy sharing your dreams and hopes with your partner?"},
    {"question": "Do you believe that love is about understanding and acceptance?"},
    {"question": "Do you enjoy spending quiet evenings at home with your partner?"},
    {"question": "Do you believe that love is about giving and receiving?"},
    {"question": "Do you enjoy creating special memories with your partner?"},
    {"question": "Do you believe that love is about trust and honesty?"},
    {"question": "Do you enjoy sharing your thoughts and feelings with your partner?"},
    {"question": "Do you believe that love is about respect and admiration?"},
    {"question": "Do you enjoy making your partner feel special?"},
    {"question": "Do you believe that love is about patience and forgiveness?"},
    {"question": "Do you enjoy celebrating your love on special occasions?"},
    {"question": "Do you believe that love is about compromise and understanding?"},
    {"question": "Do you enjoy spending time with your partner?"},
    {"question": "Do you believe that love is about support and encouragement?"},
    {"question": "Do you enjoy showing your love through actions?"},
    {"question": "Do you believe that love is about friendship and companionship?"},
    {"question": "Do you enjoy expressing your love verbally to your partner?"},
    {"question": "Do you believe that love is about sharing and caring?"},
    {"question": "Do you enjoy making your partner laugh?"},
    {"question": "Do you believe that love is about being there for each other?"},
    {"question": "Do you enjoy sharing your life with your partner?"},
    {"question": "Do you believe that love is about growing together?"},
    {"question": "Do you enjoy holding hands with your partner?"},
    {"question": "Do you believe in soul mates?"},
    {"question": "Do you enjoy planning romantic surprises for your partner?"},
    {"question": "Do you believe that romance keeps a relationship strong?"},
    {"question": "Do you enjoy cooking a special meal for your partner?"},
    {"question": "Do you enjoy giving your partner massages?"},
    {"question": "Do you believe that small romantic gestures are more meaningful than grand ones?"},
    {"question": "Do you enjoy celebrating your partner's achievements with a romantic gesture?"},
    {"question": "Do you enjoy making breakfast in bed for your partner?"},
    {"question": "Do you enjoy planning weekend getaways with your partner?"},
    {"question": "Do you enjoy planning your future with your partner?"},
    {"question": "Do you enjoy dancing with your partner?"}
  ]
}
